app/views/posts/_form.html.erb

SELECT  1 AS one FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = ? AND "subs"."id" = 1 LIMIT 1  [["post_id", 8]]
SELECT "subs".* FROM "subs"
---
          value="<%= sub.id %>"
          <%= "checked" if @post.subs.include?(sub) %>>