app/controllers/posts_controller.rb

  def new
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"

  def create
    @post = Post.new(post_params.merge({ author_id: current_user.id}))
    if @post.save
---
INSERT INTO "posts" ("author_id", "created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["author_id", 3], ["created_at", "2014-11-01 00:05:29.425785"], ["title", "Happy Friday!"], ["updated_at", "2014-11-01 00:05:29.425785"], ["url", "Hi"]]

  def edit
    @subs = Sub.all
    @post = Post.find(params[:id])
---
SELECT "subs".* FROM "subs"
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "updated_at" = ?, "url" = ? WHERE "posts"."id" = 1  [["updated_at", "2014-11-01 00:25:23.272299"], ["url", "asasdasdad"]]