app/controllers/subs_controller.rb

INSERT INTO "subs" ("created_at", "description", "moderator_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-10-31 21:14:44.133061"], ["description", "anime club"], ["moderator_id", 3], ["title", "anime"], ["updated_at", "2014-10-31 21:14:44.133061"]]
---
  def create
    @sub = Sub.new(subs_params.merge({moderator_id: current_user.id}))

    if @sub.save

SELECT  "subs".* FROM "subs"  WHERE "subs"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @sub = Sub.find(params[:id])

SELECT  "subs".* FROM "subs"  WHERE "subs"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "subs" SET "description" = ?, "updated_at" = ? WHERE "subs"."id" = 3  [["description", "woof woof"], ["updated_at", "2014-10-31 21:39:50.123668"]]
---
  def update
    @sub = Sub.find(params[:id])
    if @sub.update(subs_params)

SELECT  "subs".* FROM "subs"  WHERE "subs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @sub = Sub.find(params[:id])

SELECT "subs".* FROM "subs"   ORDER BY "subs"."title" ASC
---
  def index
    @subs = Sub.all.order(:title)